tap "homebrew/apache"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/versions"
# Automatic configure script builder
brew "autoconf"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Command-line tool for Amazon Route 53
brew "cli53"
# Statistics utility to count lines of code
brew "cloc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Asynchronous event library
brew "libevent"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl", args: ["with-nghttp2"]
# X.509 and CMS library
brew "libksba"
# GNU Portable THreads
brew "pth"
# Server for managing certificate revocation lists
brew "dirmngr"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Small git utilities
brew "git-extras"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# OpenGL Extension Wrangler Library
brew "glew"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Command-line option parsing library
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Library for USB device access
brew "libusb"
# Version Control Visualization Tool
brew "gource"
# GPG key agent
brew "gpg-agent"
# Add GitHub support to git on the command-line
brew "hub", args: ["HEAD"]
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython"
# Modular IRC client
brew "irssi"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for USB device access
brew "libusb-compat"
# VisualOn AAC encoder library
brew "libvo-aacenc"
# GNOME XML library
brew "libxml2"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Multiple Repository management tool
brew "mr"
# Lightweight database library
brew "tokyo-cabinet"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Extract just secret information out of OpenPGP secret keys
brew "paperkey"
# Password manager
brew "pass"
# Python dependency management tool
brew "pipenv"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Anonymizing overlay network for TCP
brew "tor"
# Extract, view, and test RAR archives
brew "unrar"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
cask "aws-vault"
